DataFrame Operations

In [31]:
# Ìmport the pandas library and assign the dataset a variable.
import pandas as pd
file_path = 'data/netherlands_IT_salaries_15.xlsx'
df = pd.read_excel(file_path)

In [32]:
# Add a new column named ‘Bonus’ with values calculated by ‘Experience’ column values multiplied by 2.
df['Bonus'] = df['Experience'] * 2
df

,Year,Age,Role,City,Education,Experience,Salary,Bonus
0,2018,47,Helpdeskmanager,Apeldoorn,HBO,25,4950,50
1,2018,42,Applicatiebeheerder,Almelo,HAVO,10,4086,20
2,2018,39,Software Engineer,Amsterdam,MBO,6,3600,12
3,2018,38,IT Consultant,Mierlo,HBO,15,4900,30
4,2018,38,Product Owner,Randstad,HBO,4,4650,8
5,2018,38,Product owner,Rotterdam,WO,17,3900,34
6,2018,37,Software Engineer,Groningen,HBO,9,3800,18
7,2018,37,Test Automation Engineer,Amsterdam,HBO,0,2497,0
8,2018,36,Lead Developer,Arnhem,NaN,16,4100,32
9,2018,36,BI Consultant,Randstad,HBO,12,5250,24
10,2018,36,Operations Analyst,Tessenderlo,HBO,5,3193,10
11,2018,36,System Administrator,de Meern,MBO,10,2700,20
12,2018,35,Infrastructure Architect,Randstad,HBO,15,5200,30
13,2018,35,Front-end Developer,Rotterdam,HBO,18,3600,36
14,2018,35,Project manager web development,Amersfoort,HBO,11,4000,22

In [33]:
# Delete the newly created column 'Bonus' from the DataFrame.
df.drop(columns=['Bonus'], inplace=True)
df

,Year,Age,Role,City,Education,Experience,Salary
0,2018,47,Helpdeskmanager,Apeldoorn,HBO,25,4950
1,2018,42,Applicatiebeheerder,Almelo,HAVO,10,4086
2,2018,39,Software Engineer,Amsterdam,MBO,6,3600
3,2018,38,IT Consultant,Mierlo,HBO,15,4900
4,2018,38,Product Owner,Randstad,HBO,4,4650
5,2018,38,Product owner,Rotterdam,WO,17,3900
6,2018,37,Software Engineer,Groningen,HBO,9,3800
7,2018,37,Test Automation Engineer,Amsterdam,HBO,0,2497
8,2018,36,Lead Developer,Arnhem,NaN,16,4100
9,2018,36,BI Consultant,Randstad,HBO,12,5250
10,2018,36,Operations Analyst,Tessenderlo,HBO,5,3193
11,2018,36,System Administrator,de Meern,MBO,10,2700
12,2018,35,Infrastructure Architect,Randstad,HBO,15,5200
13,2018,35,Front-end Developer,Rotterdam,HBO,18,3600
14,2018,35,Project manager web development,Amersfoort,HBO,11,4000

In [34]:
# Delete the employee with ‘Role’ as ‘Helpdeskmanager’ from the DataFrame.
df.drop(df[df['Role'] == 'Helpdeskmanager'].index, inplace=True)
df

,Year,Age,Role,City,Education,Experience,Salary
1,2018,42,Applicatiebeheerder,Almelo,HAVO,10,4086
2,2018,39,Software Engineer,Amsterdam,MBO,6,3600
3,2018,38,IT Consultant,Mierlo,HBO,15,4900
4,2018,38,Product Owner,Randstad,HBO,4,4650
5,2018,38,Product owner,Rotterdam,WO,17,3900
6,2018,37,Software Engineer,Groningen,HBO,9,3800
7,2018,37,Test Automation Engineer,Amsterdam,HBO,0,2497
8,2018,36,Lead Developer,Arnhem,NaN,16,4100
9,2018,36,BI Consultant,Randstad,HBO,12,5250
10,2018,36,Operations Analyst,Tessenderlo,HBO,5,3193
11,2018,36,System Administrator,de Meern,MBO,10,2700
12,2018,35,Infrastructure Architect,Randstad,HBO,15,5200
13,2018,35,Front-end Developer,Rotterdam,HBO,18,3600
14,2018,35,Project manager web development,Amersfoort,HBO,11,4000

In [35]:
# Modify the ‘Salary’ of the employee in ‘Amsterdam’ to 20% more.
df.loc[df['City'] == 'Amsterdam', 'Salary'] = df['Salary'] * 1.2
df

C:\Users\tjabb\AppData\Local\Temp\ipykernel_2112\2521745378.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '[4320.  2996.4]' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[df['City'] == 'Amsterdam', 'Salary'] = df['Salary'] * 1.2

,Year,Age,Role,City,Education,Experience,Salary
1,2018,42,Applicatiebeheerder,Almelo,HAVO,10,4086.0
2,2018,39,Software Engineer,Amsterdam,MBO,6,4320.0
3,2018,38,IT Consultant,Mierlo,HBO,15,4900.0
4,2018,38,Product Owner,Randstad,HBO,4,4650.0
5,2018,38,Product owner,Rotterdam,WO,17,3900.0
6,2018,37,Software Engineer,Groningen,HBO,9,3800.0
7,2018,37,Test Automation Engineer,Amsterdam,HBO,0,2996.4
8,2018,36,Lead Developer,Arnhem,NaN,16,4100.0
9,2018,36,BI Consultant,Randstad,HBO,12,5250.0
10,2018,36,Operations Analyst,Tessenderlo,HBO,5,3193.0
11,2018,36,System Administrator,de Meern,MBO,10,2700.0
12,2018,35,Infrastructure Architect,Randstad,HBO,15,5200.0
13,2018,35,Front-end Developer,Rotterdam,HBO,18,3600.0
14,2018,35,Project manager web development,Amersfoort,HBO,11,4000.0

Selecting / Filtering

In [ ]:
# Select and show only the employees (rows) with ‘Experience’ greater than 5 years.

In [ ]:
# Select and show only the employees (rows) with ‘Salary’ less than 4000.

In [ ]:
# Select and show only the employees (rows) who are ‘Product Owner’.

In [ ]:
# Select and show only the employees (rows) who have a ‘HBO’ education.

In [ ]:
# Select and show only the employees (rows) who are not in ‘Amsterdam’.

Advanced Conditional Selection

In [ ]:
# Select and show rows where ‘Salary’ is between 4000 and 5000.

In [ ]:
# Select and show rows where ‘Role’ is either ‘Product Owner’ or ‘IT Consultant’.

In [ ]:
# Select and show rows where ‘City’ is ‘Amsterdam’ and ‘Experience’ is less than 10 years, or ‘City’ is ‘Rotterdam’.

In [ ]:
# Select and show rows where ‘Role’ is ‘Product Owner’ and ‘Experience’ is greater than 5 or ‘Salary’ is greater than 4500.

In [ ]:
# Select and show rows where ‘Education’ is ‘MBO’ and ‘City’ is not ‘Apeldoorn’ or ‘Experience’ is less than 8.